"====================================================================
" gvimrc
"====================================================================

"--------------------------------------------------------------------
" ウィンドウの設定
"--------------------------------------------------------------------

" ウィンドウの幅
set columns=120

" ウィンドウの高さ
set lines=36

" ウィンドウの位置
winpos 420 180

" 水平スクロールバーを表示
"set guioptions+=b

" タブを常に表示
" set showtabline=2

"--------------------------------------------------------------------
" カラーテーマの設定
"--------------------------------------------------------------------

" colorscheme seashell
"hi Normal guifg=#00ABBC guibg=#000000
"hi LineNr guifg=#11B8C8 guibg=#000000

"--------------------------------------------------------------------
" フォントの設定
"--------------------------------------------------------------------

set guifont=VLGothic\ 12
set guifontset=Bitstream\ Vera\ Sans\ Mono\ 11:VLGothic\ 12
set guifontwide=VLGothic\ 12
"set guifont=MS\ Gothic\ 12
"set guifontset=Bitstream\ Vera\ Sans\ Mono\ 11:MS\ Gothic\ 12
"set guifontwide=MS\ Gothic\ 12

"--------------------------------------------------------------------
" カーソルの設定
"--------------------------------------------------------------------

" カーソルを常に画面の中央に表示させる
set scrolloff=999

"--------------------------------------------------------------------
" マウスの設定
"--------------------------------------------------------------------

" どのモードでもマウスを使えるようにする
set mouse=a

" マウスの移動でフォーカスを自動的に切り替えない
set nomousefocus

" 入力時にマウスポインタを隠す
set mousehide

" ペーストを*pでなくpで行う
set clipboard+=unnamed " .vimrcで指定済みかも

"--------------------------------------------------------------------
" キーボードの設定
"--------------------------------------------------------------------

" コマンドモード時に日本語変換をOFFにする
set imdisable

"--------------------------------------------------------------------
" メニューに関する設定
"--------------------------------------------------------------------

" ツールバーを表示しない
set guioptions-=T

