"====================================================================
" gvimrc
"====================================================================

"--------------------------------------------------------------------
" ウィンドウの設定
"--------------------------------------------------------------------

" ウィンドウの幅
set columns=100

" ウィンドウの高さ
set lines=29 " 解像度 1024x600 用

" ウィンドウの位置
winpos 198 0 " 解像度 1024x600 用

" 水平スクロールバーを表示
"set guioptions+=b

"--------------------------------------------------------------------
" カラーテーマの設定
"--------------------------------------------------------------------

" colorscheme seashell
"hi Normal guifg=#00ABBC guibg=#000000
"hi LineNr guifg=#11B8C8 guibg=#000000

"--------------------------------------------------------------------
" フォントの設定
"--------------------------------------------------------------------

set guifont=VLGothic\ 9
set guifontset=Bitstream\ Vera\ Sans\ Mono\ 9:VLGothic\ 9
set guifontwide=VLGothic\ 9
"set guifont=MS\ Gothic\ 11
"set guifontset=Bitstream\ Vera\ Sans\ Mono\ 11:MS\ Gothic\ 11
"set guifontwide=MS\ Gothic\ 11

"--------------------------------------------------------------------
" カーソルの設定
"--------------------------------------------------------------------

" カーソルを常に画面の中央に表示させる
set scrolloff=999

"--------------------------------------------------------------------
" マウスの設定
"--------------------------------------------------------------------

" どのモードでもマウスを使えるようにする
set mouse=a

" マウスの移動でフォーカスを自動的に切り替えない
set nomousefocus

" 入力時にマウスポインタを隠す
set mousehide

" ペーストを*pでなくpで行う
set clipboard+=unnamed " .vimrcで指定済みかも

"--------------------------------------------------------------------
" メニューに関する設定
"--------------------------------------------------------------------

" ツールバーを表示しない
set guioptions-=T
